# Домашнее задание 2 

Необходимо реализовать схему, указанную в hw_diagram.pdf

## Описание таблиц 
PeopleStatus - Описание возможных статусов людей, которые есть в университете (Студент, Преподаватель).
Faculties - Описание факультетов, которые есть в университете (KIB, IT, и т.д.).
People - Информация о людях в университете (Имя, почта, ссылка на факультет, ссылка на статус).
Classes - Описание возможных классов в университете (название (Математический анализ) и ссылка на факультет).
Semesters - Справочник семестров факультета(например, Осень2016, '2016-01-01', '2016-12-31').
ClassesSchedule - Расписание классов (ссылки на семестр, преподавателя и курс, день недели, время начала).
StudentsSchedule - Таблица, описывающая, какой студент ходит на какой курс.

In [131]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: None@None'

## Создание таблиц
Напишет ниже скрипты по созданию таблиц с учетом всех внешних ключей.

In [178]:
%%sql
DROP TABLE if exists PeopleStatus;
CREATE TABLE PeopleStatus (ID integer(0,0) NOT NULL Primary key, name varchar(0,0)); 

DROP TABLE if exists People;
CREATE TABLE People (ID integer(0,0) NOT NULL Primary key,
                    name varchar(0,0) NOT NULL,
                    email varchar(0,0),
                    fac_id integer(0,0) NOT NULL,
                    status_id integer(0,0) NOT NULL,
                    FOREIGN KEY (status_id) REFERENCES PeopleStatus(ID),
                    FOREIGN KEY (fac_id) REFERENCES Faculties(ID));

DROP TABLE if exists ClassesShedule;
CREATE TABLE ClassesShedule (ID integer(0,0) NOT NULL Primary key, 
                            class_id integer(0,0) NOT NULL,
                            teacher_id integer(0,0) NOT NULL,
                            semester_id integer(0,0) NOT NULL,
                            week_day integer(0,0),
                            time_start varchar(0,0),
                            FOREIGN KEY (semester_id) REFERENCES Semesters(ID),
                            FOREIGN KEY (class_id) REFERENCES Classes(ID),
                            FOREIGN KEY (teacher_id) REFERENCES People(ID));

DROP TABLE if exists Faculties;
CREATE TABLE Faculties (ID integer(0,0) NOT NULL Primary key,
                        name varchar(0,0) NOT NULL);

DROP TABLE if exists StudentsSchedule;
CREATE TABLE StudentsSchedule (student_id integer(0,0) NOT NULL,
                               ClassesSchedule_id integer(0,0) NOT NULL, 
                               FOREIGN KEY (student_id) REFERENCES People (ID),
                               FOREIGN KEY (ClassesSchedule_id) REFERENCES ClassesShedule (ID));

DROP TABLE if exists Semesters;
CREATE TABLE Semesters (ID integer(0,0) NOT NULL Primary key, 
                        shortname varchar(0,0), 
                        date_start date(0,0), 
                        date_end date(0,0)); 

DROP TABLE if exists Classes;
CREATE TABLE Classes (ID integer(0,0) NOT NULL Primary key, 
                      description varchar(0,0),
                      fuc_id integer(0,0) NOT NULL,
                      FOREIGN KEY (fuc_id) REFERENCES Faculties(ID));

0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

## Добавление записей в таблицы
Приведите примеры добавления записей в каждую из таблиц

In [179]:
%%sql 
INSERT INTO PeopleStatus (ID,name) VALUES (1,'student');
INSERT INTO PeopleStatus (ID,name) VALUES (2,'teacher');

select * 
from PeopleStatus
order by id

1 rows affected.
1 rows affected.
Done.

[(1, 'student'), (2, 'teacher')]

In [160]:
%%sql 
INSERT INTO Faculties (ID, name) VALUES (1,'KIB');
INSERT INTO Faculties (ID, name) VALUES (2,'IT');
INSERT INTO Faculties VALUES (3,'Electronics');
INSERT INTO Faculties VALUES (4,'Economy');

select *
from Faculties

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'KIB'), (2, 'IT'), (3, 'Electronics'), (4, 'Economy')]

In [161]:
%%sql 
INSERT INTO People (ID, name, email, fac_id, status_id) VALUES (1,'Skuzovatkina Ann', 'annskuz97@gmail.com', 1, 1);
INSERT INTO People (ID, name, email, fac_id, status_id) VALUES (2, 'Petrov Boris', null, 1, 2);
INSERT INTO People VALUES (3, 'Vetrov Sergey', 'sergey@mail.ru', 2, 1);
INSERT INTO People VALUES (4,'Zayceva Lubov', null, 3, 2);
INSERT INTO People VALUES (5,'Bunin Ivan', 'bunin@mail.com', 4, 1);
INSERT INTO People VALUES (6,'Belkina Ekaterina', 'belka@mirea.ru', 3, 1);
INSERT INTO People VALUES (7,'Volkov Dmitriy', 'DmVolk@mail.com', 2, 2);
INSERT INTO People VALUES (8,'Ivanov Egor', 'bunin@mail.com', 4, 1);
INSERT INTO People VALUES (9,'Ivanova Elena', null, 4, 2);

select * 
from People
order by id

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Skuzovatkina Ann', 'annskuz97@gmail.com', 1, 1),
 (2, 'Petrov Boris', None, 1, 2),
 (3, 'Vetrov Sergey', 'sergey@mail.ru', 2, 1),
 (4, 'Zayceva Lubov', None, 3, 2),
 (5, 'Bunin Ivan', 'bunin@mail.com', 4, 1),
 (6, 'Belkina Ekaterina', 'belka@mirea.ru', 3, 1),
 (7, 'Volkov Dmitriy', 'DmVolk@mail.com', 2, 2),
 (8, 'Ivanov Egor', 'bunin@mail.com', 4, 1),
 (9, 'Ivanova Elena', None, 1, 2)]

In [157]:
%%sql 
INSERT INTO Classes (ID, description, fuc_id) VALUES (1, 'MatAn', 1);
INSERT INTO Classes (ID, description, fuc_id) VALUES (2, 'LinAl', 3);
INSERT INTO Classes (ID, description, fuc_id) VALUES (3, 'DiffUr', 2);
INSERT INTO Classes VALUES (4, 'Economics', 4);
INSERT INTO Classes VALUES (5, 'DiffGem', 1);
INSERT INTO Classes VALUES (6, 'Electrical engineering', 3);

select *
from classes

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'MatAn', 1),
 (2, 'LinAl', 3),
 (3, 'DiffUr', 2),
 (4, 'Economics', 4),
 (5, 'DiffGem', 1),
 (6, 'electrical engineering', 3)]

In [155]:
%%sql
INSERT INTO Semesters (ID,shortname,date_start,date_end) VALUES (1,'First','2015-09-01','2015-12-31');
INSERT INTO Semesters (ID,shortname,date_start,date_end) VALUES (2,'Second','2016-02-08','2016-05-31');
INSERT INTO Semesters VALUES (3,'Third','2016-09-01','2016-12-31');
INSERT INTO Semesters VALUES (4,'Fourth','2017-02-06','2017-05-31');

select *
from Semesters

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'First', '2015-09-01', '2015-12-31'),
 (2, 'Second', '2016-08-02', '2016-05-31'),
 (3, 'Third', '2016-09-01', '2016-12-31'),
 (4, 'Fourth', '2017-06-02', '2017-05-31')]

In [168]:
%%sql 
INSERT INTO ClassesShedule (ID,class_id,teacher_id,semester_id,week_day,time_start) VALUES  (1,2,4,1,'Pn','09;00');
INSERT INTO ClassesShedule VALUES (2,5,2,2,'Vt','09:00');
INSERT INTO ClassesShedule VALUES (3,1,2,3,'Sr','13:00');
INSERT INTO ClassesShedule VALUES (4,3,7,4,'Cht','10:40');
INSERT INTO ClassesShedule VALUES (5,4,9,1,'Sr','14:40');
-- с семестрами получилось странно, но для примера же пойдет?

select *
from ClassesShedule

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 2, 4, 1, 'Pn', '09;00'),
 (2, 5, 2, 2, 'Vt', '09:00'),
 (3, 1, 2, 3, 'Sr', '13:00'),
 (4, 3, 7, 4, 'Cht', '10:40'),
 (5, 4, 9, 1, 'Sr', '14:40')]

In [166]:
%%sql
INSERT INTO StudentsSchedule (student_id, ClassesSchedule) VALUES (1,1);
INSERT INTO StudentsSchedule (student_id, ClassesSchedule) VALUES (3,3);
INSERT INTO StudentsSchedule VALUES (5,4);
INSERT INTO StudentsSchedule VALUES (6,2);
INSERT INTO StudentsSchedule VALUES (8,1);
-- Я так поняла "какой студент" - это id сеудента, а "какой курс" - это что? 
--Я написала какой студент на каком году обучения. Надеюсь, верно.

select *
from StudentsSchedule

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 1), (3, 3), (5, 4), (6, 2), (8, 1)]

Находится ли указанная схема ниже в BCNF? Напишите ниже функциональные зависимости, которые вы считаете, есть в указанной схеме.